app/controllers/api/finishers_controller.rb

SELECT "finishers".* FROM "finishers"
---
  def index
    # finishers = Setting.find(params[:setting_id])
    #                    .finishers
    #                    .where(middle_id: params[:middle_id])
    @finishers = Finisher.all

SELECT  "finishers".* FROM "finishers" WHERE "finishers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @finisher = Finisher.find(params[:id])