app/controllers/api/middles_controller.rb

  def index
    @middles = Middle.all
---
SELECT "middles".* FROM "middles"

  def show
    @middle = Middle.find(params[:id])
---
SELECT  "middles".* FROM "middles" WHERE "middles"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]