app/controllers/api/starters_controller.rb

  def index
    @starters = Starter.all
---
SELECT "starters".* FROM "starters"

  def show
    @starter = Starter.find(params[:id])
---
SELECT  "starters".* FROM "starters" WHERE "starters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]